; domain
(define (domain liftedtcore_blocksworld-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :action-costs)
 (:types block)
 (:constants
   black_block_2 red_block_1 white_block_2 - block
 )
 (:predicates (clear ?obj - block) (ontable ?obj - block) (handempty) (holding ?obj - block) (on ?obj1 - block ?obj2 - block) (hold_0) (seen_psi_1) (hold_2))
 (:functions (total-cost))
 (:action pickup
  :parameters ( ?obj - block)
  :precondition (and (clear ?obj) (ontable ?obj) (handempty) (or (not (and (ontable black_block_2) (not (= ?obj black_block_2)))) (seen_psi_1)))
  :effect (and (holding ?obj) (not (clear ?obj)) (not (ontable ?obj)) (not (handempty)) (when (and (ontable black_block_2) (not (= ?obj black_block_2))) (hold_0)) (when (or (not (and (ontable white_block_2) (not (= ?obj white_block_2)))) (not (and (clear red_block_1) (not (= ?obj red_block_1))))) (seen_psi_1)) (when (not (and (clear red_block_1) (not (= ?obj red_block_1)))) (hold_2)) (increase (total-cost) 1)))
 (:action putdown
  :parameters ( ?obj - block)
  :precondition (and (holding ?obj) (or (not (or (= ?obj black_block_2) (ontable black_block_2))) (seen_psi_1)))
  :effect (and (clear ?obj) (handempty) (ontable ?obj) (not (holding ?obj)) (when (or (= ?obj black_block_2) (ontable black_block_2)) (hold_0)) (when (or (not (or (= ?obj white_block_2) (ontable white_block_2))) (not (or (= ?obj red_block_1) (clear red_block_1)))) (seen_psi_1)) (when (not (or (= ?obj red_block_1) (clear red_block_1))) (hold_2)) (increase (total-cost) 1)))
 (:action stack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (clear ?underobj) (holding ?obj))
  :effect (and (handempty) (clear ?obj) (on ?obj ?underobj) (not (clear ?underobj)) (not (holding ?obj)) (when (or (not (ontable white_block_2)) (not (or (= ?obj red_block_1) (and (clear red_block_1) (not (= ?underobj red_block_1)))))) (seen_psi_1)) (when (not (or (= ?obj red_block_1) (and (clear red_block_1) (not (= ?underobj red_block_1))))) (hold_2)) (increase (total-cost) 1)))
 (:action unstack
  :parameters ( ?obj - block ?underobj - block)
  :precondition (and (on ?obj ?underobj) (clear ?obj) (handempty))
  :effect (and (holding ?obj) (clear ?underobj) (not (on ?obj ?underobj)) (not (clear ?obj)) (not (handempty)) (when (or (not (ontable white_block_2)) (not (or (= ?underobj red_block_1) (and (clear red_block_1) (not (= ?obj red_block_1)))))) (seen_psi_1)) (when (not (or (= ?underobj red_block_1) (and (clear red_block_1) (not (= ?obj red_block_1))))) (hold_2)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_blocksworld-problem)
 (:domain liftedtcore_blocksworld-domain)
 (:objects
   black_block_1 white_block_1 - block
 )
 (:init (ontable black_block_1) (on red_block_1 black_block_1) (ontable white_block_1) (ontable white_block_2) (on black_block_2 white_block_2) (clear red_block_1) (clear white_block_1) (clear black_block_2) (handempty) (= (total-cost) 0))
 (:goal (and (holding white_block_2) (hold_0) (hold_2)))
 (:metric minimize (total-cost))
)

; plan
1. (unstack black_block_2 white_block_2)
   deleted: (on black_block_2 white_block_2) (clear black_block_2) (handempty)
   added: (holding black_block_2) (clear white_block_2)
   goals met: 0 of 3
2. (stack black_block_2 red_block_1)
   deleted: (clear red_block_1) (holding black_block_2)
   added: (handempty) (clear black_block_2) (on black_block_2 red_block_1) (seen_psi_1) (hold_2)
   goals met: 1 of 3
3. (unstack black_block_2 red_block_1)
   deleted: (on black_block_2 red_block_1) (clear black_block_2) (handempty)
   added: (holding black_block_2) (clear red_block_1)
   goals met: 1 of 3
4. (putdown black_block_2)
   deleted: (holding black_block_2)
   added: (clear black_block_2) (handempty) (ontable black_block_2) (hold_0)
   goals met: 2 of 3
5. (pickup white_block_2)
   deleted: (clear white_block_2) (ontable white_block_2) (handempty)
   added: (holding white_block_2)
   goals met: 3 of 3
